InformationRegisters/ИА_ДневникСостояний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДневникСостояний</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наклон</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_НаклонГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_Напоминания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЗадачиПлана</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_СобытияКалендаряGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_СобытияКалендаряGoogle</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>БезВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>идКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>идСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ВыгрузкаЗадачВГуглКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ВыгрузкаЗадачВГуглКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяВыгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЗадачиПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ДоступКGoogleКалендарю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ДоступКGoogleКалендарю</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Календари</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарьВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_ТипыЗадачБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыЗадачБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регулярные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стратегические</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_ЗадачиПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ЗадачиПлана</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_ПланыДействий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группировка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
						<v8:Type>cfg:EnumRef.ИА_ТипыЗадачБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>идСобытияГугл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_Планы/Ext/Module.bsl
// Обрабатываает структуру с боевыми планами.
// Удаляет старые недельны планы (у которых родитель ПОСТ) по каждому постe, оставляет не более чем КоличествоПланов по каждому посту
Процедура УдалитьСтарыеПланы(ДеревоПланов, КоличествоПланов = 1) Экспорт
	
	// удаляем планы с конца, до тех пор их колчисево не станет меньше или равным КоличествоПланов
	Пока ДеревоПланов.Планы.Количество() > КоличествоПланов Цикл
		ДеревоПланов.Планы.Удалить(ДеревоПланов.Планы.Количество()-1);
	КонецЦикла;
	
	// идем по дочерним постам
	Для Каждого ДочернийПост Из ДеревоПланов.Посты Цикл
		УдалитьСтарыеПланы(ДочернийПост, КоличествоПланов);
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаменитьПостыНаСотрудников(ДеревоПланов, ПостСОтвевенным = Неопределено) Экспорт
	
	// проанализируем, чьи планы есть на посту
	МассивОтвественных = Новый Массив;
	Для Каждого План Из ДеревоПланов.Планы Цикл
		Если МассивОтвественных.Найти(План.Отвественный) = Неопределено Тогда
			МассивОтвественных.Добавить(План.Отвественный);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОтвественных.Количество() > 0 Тогда
		ДеревоПланов.Пост = МассивОтвественных[0];
	КонецЕсли;
	
	// идем по дочерним постам
	Для Каждого ДочернийПост Из ДеревоПланов.Посты Цикл
		ЗаменитьПостыНаСотрудников(ДочернийПост);
	КонецЦикла;
	
КонецПроцедуры


// в процедура передаем верхний пост
// далее бежим рекурсивно по всем подчиненным постам
// если у текущего поста, пост = пользователь, то ничего не делаем, если = оргсхема, то поднимаем все планы на уровень родителя



// нам надо чтобы не было секуций без планов
// если есть секция без планов, то всее ее планы надо засунуть в родителя

Процедура СвернутьПоСотрудникам(ДеревоПланов) Экспорт
	
	//Сообщить("ПОСТ: "+ДеревоПланов.Пост+". РОДИТЕЛЬ:"+?(Родитель=Неопределено,"нан",Родитель.Пост));
	
	// просмотрим все посты которые у меня есть в подчинении, если надйем пост с ОРГСХЕМОЙ, то забираем из него все посты в себя, и так до тех пор пока есть хоть один пост с оргсхемой
	
	
	
	Если ТипЗнч(ДеревоПланов.Пост) = Тип("СправочникСсылка.Пользователи") Тогда
		
		ТребутсяПроверка = Истина;
		
		Пока ТребутсяПроверка Цикл
			ТребутсяПроверка = Ложь;
			
			СписокУдаляемыхПостов = Новый Массив;
			
			Для Каждого МойДочернийПост из ДеревоПланов.Посты Цикл
				
				Если ТипЗнч(МойДочернийПост.Пост) = Тип("СправочникСсылка.ОргСхема") Тогда
					
					ТребутсяПроверка = Истина;
					
					// забираем все посты
					Для Каждого ПереносимыйПост Из МойДочернийПост.Посты Цикл
						ДеревоПланов.Посты.Добавить(ПереносимыйПост);
					КонецЦикла;
					
					СписокУдаляемыхПостов.Добавить(МойДочернийПост);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого УдаляемыйПост из СписокУдаляемыхПостов Цикл
				
				ИндексПоста = ДеревоПланов.Посты.Найти(УдаляемыйПост);
				ДеревоПланов.Посты.Удалить(ИндексПоста);
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
	// на дном уровне могут быть записи с одинаковым знаечние пост, надо планы собрать в один пост
	СписокУдаляемыхПостов = Новый Массив;
	
	ПервыеПосты = Новый Соответствие; // Пост, СтруктураПост
	
	Для Каждого СтруктураПост Из  ДеревоПланов.Посты Цикл
		
		СтруктураНазанчение = ПервыеПосты.Получить(СтруктураПост.Пост);
		
		Если СтруктураНазанчение = Неопределено Тогда
			
			ПервыеПосты.Вставить(СтруктураПост.Пост, СтруктураПост);
			
		Иначе
			
			Для Каждого План из СтруктураПост.Планы Цикл
				СтруктураНазанчение.Планы.Добавить(План);
			КонецЦикла;
			
			СписокУдаляемыхПостов.Добавить(СтруктураПост);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаляемыйПост из СписокУдаляемыхПостов Цикл
				
		ИндексПоста = ДеревоПланов.Посты.Найти(УдаляемыйПост);
		ДеревоПланов.Посты.Удалить(ИндексПоста);
		
	КонецЦикла;
			
	
	
	Для Каждого СтруктураПост из ДеревоПланов.Посты Цикл
		СвернутьПоСотрудникам(СтруктураПост); //, ДеревоПланов, ?(ТипЗнч(ДеревоПланов.Пост) = Тип("СправочникСсылка.ОргСхема"),Родитель,ДеревоПланов));
	КонецЦикла;
	
		
КонецПроцедуры
	
////////// ДНЕВНИК

Функция ПолучитьДневникСервер(ПериодС,ПериодПо,Пост) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ДневникСостояний.Период КАК Период,
	               |	ИА_ДневникСостояний.ИД,
	               |	ИА_ДневникСостояний.Пост,
	               |	ИА_ДневникСостояний.Наклон,
	               |	ИА_ДневникСостояний.Состояние,
	               |	ИА_ДневникСостояний.Шаг,
	               |	ИА_ДневникСостояний.Задача,
	               |	ИА_ДневникСостояний.Выполнено,
	               |	ИА_ДневникСостояний.ДатаВыполнения,
	               |	ВЫБОР
	               |		КОГДА ИА_ДневникСостояний.Наклон = ЗНАЧЕНИЕ(Перечисление.ИА_НаклонГрафика.ПустаяСсылка)
	               |			ТОГДА -1
	               |		ИНАЧЕ ИА_ДневникСостояний.Наклон.Порядок
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	ЛОЖЬ КАК НовоеСостояние
	               |ИЗ
	               |	РегистрСведений.ИА_ДневникСостояний КАК ИА_ДневникСостояний
	               |ГДЕ
	               |	ИА_ДневникСостояний.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |	И ИА_ДневникСостояний.Пост = &Пост
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Запрос.УстановитьПараметр("ДатаНачала", ПериодС);
	Запрос.УстановитьПараметр("ДатаКонца", ПериодПо);
	Запрос.УстановитьПараметр("Пост", Пост);
	
	тз = Запрос.Выполнить().Выгрузить();
	Возврат тз;
КонецФункции

Процедура СохранитьИзмененияДневника(СтрокаДн) Экспорт
	УдалитьСтрокуДневника(СтрокаДн.ИД);
	
	мен = РегистрыСведений.ИА_ДневникСостояний.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(мен, СтрокаДн);
	мен.Записать(истина);
КонецПроцедуры

Процедура УдалитьСтрокуДневника(ид) Экспорт
	мен = РегистрыСведений.ИА_ДневникСостояний.СоздатьНаборЗаписей();
	мен.Отбор.ИД.Значение = ид;
	мен.Отбор.ИД.Использование = истина;
	мен.Записать(истина);
КонецПроцедуры

Функция ПолучитьРодителя(пШаг) Экспорт
	возврат пШаг.Родитель;
КонецФункции

Функция ПолучитьПервыйШаг(пСостояние) Экспорт
	выборка = Справочники.ИА_Состояния.Выбрать(пСостояние,,,"Код");
	
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			возврат выборка.Ссылка;              	
		КонецЕсли;
	КонецЦикла;
	
	возврат Справочники.ИА_Состояния.ПустаяСсылка();
КонецФункции

Функция ПолучитьПорядок(пНаклон) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_НаклонГрафика.Порядок
	               |ИЗ
	               |	Перечисление.ИА_НаклонГрафика КАК ИА_НаклонГрафика
	               |ГДЕ
	               |	ИА_НаклонГрафика.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", пНаклон);
	Выборка = Запрос.Выполнить().Выбрать();
	выборка.Следующий();
	возврат Выборка.Порядок;
КонецФункции

Функция ПолучитьСледующийШаг(пШаг) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_Состояния.Ссылка
	               |ИЗ
	               |	Справочник.ИА_Состояния КАК ИА_Состояния
	               |ГДЕ
	               |	ИА_Состояния.Родитель = &Родитель
	               |	И ИА_Состояния.Код > &Код
	               |	И ИА_Состояния.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_Состояния.Код";
	Запрос.УстановитьПараметр("Родитель", пШаг.Родитель);
	Запрос.УстановитьПараметр("Код", пШаг.Код);
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда // найден шаг в рамках текущего состояния
		возврат Выборка.Ссылка;
	Иначе // переходим на следующее состояние
		следСост = Неопределено;
		Если пШаг.Родитель = Справочники.ИА_Состояния.Несуществование Тогда	
			следСост = Справочники.ИА_Состояния.Опасность;
		ИначеЕсли пШаг.Родитель = Справочники.ИА_Состояния.Опасность Тогда	
			следСост = Справочники.ИА_Состояния.ЧрезвычайноеПоложение;
		ИначеЕсли пШаг.Родитель = Справочники.ИА_Состояния.ЧрезвычайноеПоложение Тогда	
			следСост = Справочники.ИА_Состояния.НормальнаяДеятельность;
		ИначеЕсли пШаг.Родитель = Справочники.ИА_Состояния.НормальнаяДеятельность Тогда	
			следСост = Справочники.ИА_Состояния.Изобилие;
		ИначеЕсли пШаг.Родитель = Справочники.ИА_Состояния.Изобилие Тогда	
			следСост = Справочники.ИА_Состояния.Могущество;
		КонецЕсли;
		
		Если следСост = Неопределено Тогда
			возврат Справочники.ИА_Состояния.ПустаяСсылка();
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Родитель", следСост);
		Запрос.УстановитьПараметр("Код", "000");
		Выборка = Запрос.Выполнить().Выбрать();
		Если выборка.Следующий() Тогда 
			возврат Выборка.Ссылка;
		Иначе
			возврат Справочники.ИА_Состояния.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьШагиСостояния(пСостояние) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_Состояния.Ссылка
	               |ИЗ
	               |	Справочник.ИА_Состояния КАК ИА_Состояния
	               |ГДЕ
	               |	ИА_Состояния.Родитель = &Родитель
	               |	И ИА_Состояния.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_Состояния.Код";
	Запрос.УстановитьПараметр("Родитель", пСостояние);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция	ПолучитьПредыдущуюКвоту(пВидСтатистики, Ответственный, Родитель, ДатаНачала) Экспорт
	Если Не ЗначениеЗаполнено(Ответственный) ИЛИ Не ЗначениеЗаполнено(пВидСтатистики) Тогда
		Возврат 0;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ИА_ПланыДействийПлан.КвотаПлан
		               |ИЗ
		               |	Справочник.ИА_ПланыДействий.План КАК ИА_ПланыДействийПлан
		               |ГДЕ
		               |	ИА_ПланыДействийПлан.Ссылка.Ответственный = &Ответственный
		               |	И ИА_ПланыДействийПлан.ВидСтатистики = &ВидСтатистики
		               |	И ИА_ПланыДействийПлан.Ссылка.ДатаНачала < &ДатаНачала
		               |	И ИА_ПланыДействийПлан.Ссылка.Родитель = &Родитель
		               |	И ИА_ПланыДействийПлан.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ИА_ПланыДействийПлан.Ссылка.ДатаНачала УБЫВ";
		Запрос.УстановитьПараметр("Ответственный",Ответственный);
		Запрос.УстановитьПараметр("Родитель",Родитель);
		Запрос.УстановитьПараметр("ВидСтатистики",пВидСтатистики);
		Запрос.УстановитьПараметр("ДатаНачала",?(ЗначениеЗаполнено(ДатаНачала), ДатаНачала, ТекущаяДата()));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.КвотаПлан 
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьЗначениеСтатистики(пВидСтатистики, пАналитика1, пАналитика2, пАналитика3, пДатаНачала, пРодитель) Экспорт
	Если ЗначениеЗаполнено(пРодитель) Тогда // дневной
		ДатаНач = НачалоДня(пДатаНачала) - 60*60*24;
		ДатаКон = КонецДня(ДатаНач);
	Иначе
		ДатаНач = НачалоДня(пДатаНачала) - 60*60*24*7;
		ДатаКон = НачалоДня(пДатаНачала) - 1;
	КонецЕсли;
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ДатаНачала");
	Данные.Колонки.Добавить("ДатаКонца");
	Новстр = Данные.Добавить();
	Новстр.ДатаНачала = ДатаНач;
	Новстр.ДатаКонца = ДатаКон;
	СтрокаСтатистик = Новый Структура("ВидСтатистики,Аналитика1,Аналитика2,Аналитика3,Данные",пВидСтатистики, пАналитика1, пАналитика2, пАналитика3,Данные);
	
	ТЗ = ИА_Защита_Статистика.ПолучитьТЗДанныеСтатистики(СтрокаСтатистик,ДатаНач,ДатаКон);
	
	возврат тз.Итог("Количество");
КонецФункции

//

Процедура РаспределитьЗадачиДневногоПлана(план) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ЗадачиПлана.Ссылка КАК Ссылка,
	               |	ИА_ЗадачиПлана.ВремяПлан КАК ВремяПлан,
	               |	ИА_ЗадачиПлана.ВремяФакт КАК ВремяФакт,
	               |	ИА_ЗадачиПлана.ВремяНачала КАК ВремяНачала,
	               |	ИА_ЗадачиПлана.ВремяКонца КАК ВремяКонца,
	               |	ИА_ЗадачиПлана.Код КАК Код,
	               |	ВЫБОР
	               |		КОГДА ИА_ЗадачиПлана.ВремяНачала = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК УказанаДатаНачала
	               |ИЗ
	               |	Справочник.ИА_ЗадачиПлана КАК ИА_ЗадачиПлана
	               |ГДЕ
	               |	ИА_ЗадачиПлана.Владелец = &Владелец
	               |	И ИА_ЗадачиПлана.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УказанаДатаНачала,
	               |	ВремяНачала,
	               |	ВремяПлан УБЫВ";
	Запрос.УстановитьПараметр("Владелец",план);
	тз = Запрос.Выполнить().Выгрузить();
	Если тз.Количество() = 0 Тогда
		возврат;
	КонецЕсли;
	
	рабВремя = ПолучитьРабочееВремя();
	
	Если тз.Количество()>0 И не ЗначениеЗаполнено(тз[0].ВремяНачала) Тогда // первое распределение сделаем по исходному плану
		тз.Сортировать("Код");	
	КонецЕсли;
	
	ВсеОбработаны = ложь;
	Пока не ВсеОбработаны Цикл
		Для каждого стр из ТЗ Цикл
			ВсеОбработаны = истина;
			если не ЗначениеЗаполнено(стр.ВремяНачала) Тогда
				ВсеОбработаны = ложь;
				
				сч = 0;
				кол = тз.Количество();
				
				СтрокаДобавлена = ложь;
				послЗапДК = рабВремя.ВремяНачалаДня;
				ПослИндекс = 0;
				
				Пока сч<кол Цикл
					
					Если ЗначениеЗаполнено(тз[сч].ВремяКонца) ТОгда
						послЗапДК = тз[сч].ВремяКонца + 1;
						ПослИндекс = сч + 1;
					Иначе 
						Прервать;
					КонецЕсли;
					
					Если сч<кол-1 И ЗначениеЗаполнено(тз[сч].ВремяКонца) И ЗначениеЗаполнено(тз[сч+1].ВремяНачала) 
						И ВремяВЧисло(тз[сч+1].ВремяНачала) - ВремяВЧисло(тз[сч].ВремяКонца) > ВремяВЧисло(тз[сч].ВремяПлан) Тогда
						Новстр = тз.Вставить(сч+1);
						ЗаполнитьЗначенияСвойств(Новстр, стр);
						Новстр.ВремяНачала = тз[сч].ВремяКонца + 1;
						Новстр.ВремяКонца = Новстр.ВремяНачала + ВремяВЧисло(Новстр.ВремяПлан);
						
						СтрокаДобавлена = Истина;
						Прервать;
					КонецЕсли;
					
					сч = сч + 1;
				КонецЦикла;
				
				Если не СтрокаДобавлена Тогда
					Новстр = тз.Вставить(ПослИндекс);
					ЗаполнитьЗначенияСвойств(Новстр, стр);
					Новстр.ВремяНачала = послЗапДК;
					Новстр.ВремяКонца = Новстр.ВремяНачала + ВремяВЧисло(Новстр.ВремяПлан);										
				КонецЕсли;
				
				об = стр.ссылка.получитьОбъект();
				ЗаполнитьЗначенияСвойств(об,новстр,"ВремяНачала,ВремяКонца");
				об.записать();
				
				тз.Удалить(стр);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

функция ВремяВЧисло(пВр) Экспорт
	возврат 60*60*час(пВр) + 60*Минута(пвр);
КонецФункции

Функция ПолучитьРабочееВремя(Пользователь = Неопределено) Экспорт
	
	текюзер = Пользователь;
	Если текюзер = Неопределено Тогда
		текюзер =  ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ВремяНачалаДня = Дата(1,1,1,8,0,0);
	ВремяКонцаДня = Дата(1,1,1,19,0,0);
	
	ВремяНачалаДня1 = Константы.КСУ_НачалоРабочегоДня.Получить();
	ВремяКонцаДня1 = Константы.КСУ_КонецРабочегоДня.Получить();
	Если ЗначениеЗаполнено(ВремяНачалаДня1) и ЗначениеЗаполнено(ВремяКонцаДня1) Тогда
		ВремяНачалаДня = ВремяНачалаДня1;
		ВремяКонцаДня = ВремяКонцаДня1;
	КонецЕсли;
	ВремяНачалаДня1 = ИА_НастройкиСПИ.ЗначениеНастройки(текюзер,ПланыВидовХарактеристик.ИА_НастройкиПользователей.НачалоРабочегоДня);
	ВремяКонцаДня1 = ИА_НастройкиСПИ.ЗначениеНастройки(текюзер,ПланыВидовХарактеристик.ИА_НастройкиПользователей.КонецРабочегоДня);
	Если ЗначениеЗаполнено(ВремяНачалаДня1) и ЗначениеЗаполнено(ВремяКонцаДня1) Тогда
		ВремяНачалаДня = ВремяНачалаДня1;
		ВремяКонцаДня = ВремяКонцаДня1;
	КонецЕсли;

	Возврат новый Структура("ВремяНачалаДня,ВремяКонцаДня",ВремяНачалаДня,ВремяКонцаДня);
КонецФункции

Функция ПолучитьДневнойПлан(недельный, ДатаНачала) Экспорт
	Запрос = Новый запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ПланыДействий.Ссылка
	               |ИЗ
	               |	Справочник.ИА_ПланыДействий КАК ИА_ПланыДействий
	               |ГДЕ
	               |	ИА_ПланыДействий.Родитель = &Родитель
	               |	И ИА_ПланыДействий.ДатаНачала = &ДатаНачала
	               |	И ИА_ПланыДействий.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("Родитель", недельный);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		возврат Выборка.Ссылка;
	Иначе
		возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ЗАвершитьЗадачуКЦ(Задача, доклад = Неопределено) Экспорт 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	ОбъектЗадачи = Задача.ПолучитьОбъект();
	Если доклад <> Неопределено Тогда
		ОбъектЗадачи.ДокладОбИсполнении = доклад;
	КонецЕсли;
	ИА_Защита_КЦ.ЗадачаВыполнитьНаСервере(ТекПользователь, ОбъектЗадачи);
	ИА_ОбщиеПроцедуры_Технология_КоммЦентр_Сервер.ОбновитьДанныеКорзины("Входящие");
	ИА_ОбщиеПроцедуры_Технология_КоммЦентр_Сервер.ОбновитьДанныеКорзины("ВРаботе");
КонецПроцедуры

Функция НуженДокладПоЗадачеКЦ(задача) Экспорт
	возврат (не задача.ЭтоПослание) и (не задача.ЭтоЗРС);
КонецФункции

Функция ЗначениеРеквизита(пСсылка, рекв) Экспорт
	возврат пСсылка[рекв];
КонецФункции

Функция ПолучитьНапоминания() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_Напоминания.Период,
	               |	КСУ_Напоминания.Пользователь,
	               |	КСУ_Напоминания.Объект,
	               |	КСУ_Напоминания.Тема,
	               |	КСУ_Напоминания.Текст
	               |ИЗ
	               |	РегистрСведений.КСУ_Напоминания КАК КСУ_Напоминания
	               |ГДЕ
	               |	КСУ_Напоминания.Пользователь = &Пользователь
	               |	И КСУ_Напоминания.Период <= &Период";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Период", ТекущаяДата() + 30);
	резТЗ = запрос.Выполнить().Выгрузить();
	
	рез = новый Массив;
	для каждого стр из резТЗ Цикл
		Новстр = Новый Структура("Тема,Текст",стр.Тема,стр.Текст);
		рез.Добавить(Новстр);
		
		наб = РегистрыСведений.КСУ_Напоминания.СоздатьНаборЗаписей();
		наб.Отбор.Пользователь.Установить(стр.Пользователь);
		наб.Отбор.Объект.Установить(стр.Объект);

		наб.Записать(истина);
	КонецЦикла;
	
	Возврат рез;
КонецФункции

Процедура УдалитьЗадачуГугл(идСобытия) Экспорт
	мен = РегистрыСведений.КСУ_СобытияКалендаряGoogle.СоздатьМенеджерЗаписи();
	мен.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	мен.идСобытия = идСобытия;
	мен.Прочитать();
	
	//
	Соединение = Новый HTTPСоединение("www.googleapis.com", ,,,,, Новый ЗащищенноеСоединениеOpenSSL());		
	access_token = ИА_КСУОбщийСервер.ПолучитьAccessTokenИзRefresh(Соединение);
		
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.Заголовки["Content-Type"] = "application/x-www-form-urlencoded";
	ЗапросHTTP.Заголовки["Authorization"] = "Bearer " + access_token;
	ЗапросHTTP.АдресРесурса = "calendar/v3/calendars/"+мен.идКалендаря+"/events/"+идСобытия;
			
	ОтветHTTP = Соединение.Удалить(ЗапросHTTP);
	//
	
	мен.Удалить();
КонецПроцедуры

Процедура СинхронизироватьКалендариГугл(ПолноеОбновление = ложь) Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.ид
	               |ИЗ
	               |	РегистрСведений.КСУ_ВыгрузкаЗадачВГуглКалендарь КАК КСУ_ВыгрузкаЗадачВГуглКалендарь";
	идЗадачКСУ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ид");
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ДоступКGoogleКалендарю.Пользователь,
	               |	КСУ_ДоступКGoogleКалендарю.Токен,
	               |	КСУ_ДоступКGoogleКалендарю.Календари,
	               |	КСУ_ДоступКGoogleКалендарю.ТокенОбновления,
	               |	КСУ_ДоступКGoogleКалендарю.КалендарьВыгрузки
	               |ИЗ
	               |	РегистрСведений.КСУ_ДоступКGoogleКалендарю КАК КСУ_ДоступКGoogleКалендарю
	               |ГДЕ
	               |	КСУ_ДоступКGoogleКалендарю.Токен <> """"";
	Юзеры = запрос.Выполнить().Выгрузить();
	
	Соединение = Новый HTTPСоединение("www.googleapis.com", ,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	Для каждого польз из Юзеры цикл
		Календари = ЗначениеИзСтрокиВнутр(польз.Календари);
		//		
		access_token = ИА_КСУОбщийСервер.ПолучитьAccessTokenИзRefresh(Соединение, польз.токен);
		
		ЗапросHTTP = Новый HTTPЗапрос;
		ЗапросHTTP.Заголовки["Content-Type"] = "application/x-www-form-urlencoded";
		ЗапросHTTP.Заголовки["Authorization"] = "Bearer " + access_token;
		
		Для каждого идКалендаря из Календари Цикл			
			адресбезТокена = "calendar/v3/calendars/"+идКалендаря+"/events?singleEvents=true";
			Если польз.ТокенОбновления = "" или ПолноеОбновление Тогда
				ЗапросHTTP.АдресРесурса = адресбезТокена;
			Иначе
				ЗапросHTTP.АдресРесурса = адресбезТокена+"&syncToken="+польз.ТокенОбновления;
			КонецЕсли;
			
			ОтветHTTP = Соединение.Получить(ЗапросHTTP);
			Если ОтветHTTP.КодСостояния = 401 Тогда
				ЗапросHTTP.АдресРесурса = адресбезТокена;
				ОтветHTTP = Соединение.Получить(ЗапросHTTP);
			КонецЕсли;
			
			ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
			Если ОтветHTTP.КодСостояния = 200 Тогда		
				JSonИт = Новый ЧтениеJSON;
				JSonИт.УстановитьСтроку(ТекстОтвета);
				резИт = ПрочитатьJSON(JSonИт);
				
				
				ЗагрузитьСобытия(резИт.items, польз.Пользователь, идКалендаря,идЗадачКСУ);
				Пока резИт.Свойство("nextPageToken") и резИт.nextPageToken<>"" Цикл
					ЗапросHTTP.АдресРесурса = адресбезТокена+"&pageToken="+резИт.nextPageToken;
					ОтветHTTP = Соединение.Получить(ЗапросHTTP);
					ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
					JSonИт.УстановитьСтроку(ТекстОтвета);
					резИт = ПрочитатьJSON(JSonИт);								
					ЗагрузитьСобытия(резИт.items, польз.Пользователь, идКалендаря,идЗадачКСУ);
				КонецЦикла;
				
				
				мен = РегистрыСведений.КСУ_ДоступКGoogleКалендарю.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(мен, польз);
				мен.ТокенОбновления = резИт.nextSyncToken;
				мен.Записать(истина);
			Иначе
				ЗаписьЖурналаРегистрации("КСУ ошибка гугл",,,,"Ошибка получения списка событий "+ ТекстОтвета);
			КонецЕсли;
		КонецЦикла;			
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьСобытия(События, Пользователь, идКалендаря,идЗадачКСУ)
	Для каждого Задача из События Цикл
		Если идЗадачКСУ.найти(Задача.id)<>Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МенСобытия = РегистрыСведений.КСУ_СобытияКалендаряGoogle.СоздатьМенеджерЗаписи();
		МенСобытия.Пользователь = Пользователь;
		МенСобытия.идСобытия = Задача.id;					
		МенСобытия.идКалендаря = идКалендаря;					
		
		Если Задача.status = "cancelled" или не Задача.свойство("summary") тогда
			МенСобытия.Прочитать();
			Если МенСобытия.Выбран() Тогда
				МенСобытия.Пользователь = Пользователь;
				МенСобытия.идСобытия = Задача.id;					
				МенСобытия.Удалить();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если Задача.start.Свойство("date") Тогда
			МенСобытия.ДатаНачала = ПолучитьДатуИзУниверс(Задача.start.date);
			МенСобытия.ДатаКонца = ПолучитьДатуИзУниверс(Задача.end.date);
			МенСобытия.БезВремени = истина;
		Иначе
			МенСобытия.ДатаНачала = ПолучитьДатуИзУниверс(Задача.start.dateTime);
			МенСобытия.ДатаКонца = ПолучитьДатуИзУниверс(Задача.end.dateTime);
			
			Если НачалоДня(МенСобытия.ДатаНачала)<>НачалоДня(МенСобытия.ДатаКонца) Тогда
				МенСобытия.БезВремени = истина;
			КонецЕсли;
		КонецЕсли;
		МенСобытия.Описание = Задача.summary;
		МенСобытия.Записать(истина);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьДатуИзУниверс(знач универс) Экспорт
	универс = лев(универс,19);
	универс= СтрЗаменить(универс,"-","");
	универс= СтрЗаменить(универс,":","");
	универс= СтрЗаменить(универс,"T","");
	Возврат дата(универс);
КонецФункции

Процедура КСУ_СинхронизацияGoogleКалендари() Экспорт
	ВыгрузитьЗадачиВГугл();
	СинхронизироватьКалендариГугл();
КонецПроцедуры

Процедура ВыгрузитьЗадачиВГугл() Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.Задача,
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.ид,
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.ТребуетсяВыгрузка,
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.Содержание,
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.ВремяНачала,
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.ВремяКонца,
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.Дата,
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.Пользователь КАК Пользователь,
	               |	КСУ_ДоступКGoogleКалендарю.Токен,
	               |	КСУ_ДоступКGoogleКалендарю.КалендарьВыгрузки
	               |ИЗ
	               |	РегистрСведений.КСУ_ВыгрузкаЗадачВГуглКалендарь КАК КСУ_ВыгрузкаЗадачВГуглКалендарь
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КСУ_ДоступКGoogleКалендарю КАК КСУ_ДоступКGoogleКалендарю
	               |		ПО КСУ_ВыгрузкаЗадачВГуглКалендарь.Пользователь = КСУ_ДоступКGoogleКалендарю.Пользователь
	               |			И (КСУ_ДоступКGoogleКалендарю.Токен <> """")
	               |			И (КСУ_ДоступКGoogleКалендарю.КалендарьВыгрузки <> """")
	               |ГДЕ
	               |	КСУ_ВыгрузкаЗадачВГуглКалендарь.ТребуетсяВыгрузка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Пользователь";
	События = запрос.Выполнить().Выгрузить();
	Если События.Количество() = 0 Тогда
		возврат;
	КонецЕсли;
		
	Соединение = Новый HTTPСоединение("www.googleapis.com", ,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	ЗапросHTTP = Новый HTTPЗапрос;
	ТекПользователь = Неопределено;
	Для каждого ТекСобытие из События цикл
		Если ТекСобытие.Пользователь <> ТекПользователь Тогда
			access_token = ИА_КСУОбщийСервер.ПолучитьAccessTokenИзRefresh(Соединение, ТекСобытие.токен);
			ЗапросHTTP.Заголовки["Content-Type"] = "application/json";
			ЗапросHTTP.Заголовки["Authorization"] = "Bearer " + access_token;
			ТекПользователь = ТекСобытие.Пользователь;			
		КонецЕсли;
		
		идКалендаря = ТекСобытие.КалендарьВыгрузки;
		идСобытия = ТекСобытие.ид;
		
		ЗапросHTTP.АдресРесурса = "calendar/v3/calendars/"+идКалендаря+"/events";
		ТелоЗапроса = 
		"{
		|		""summary"": ""%Заголовок"",	  
		|		""start"": {
		|			""dateTime"": ""%ДатаНачала""
		|			},
		|		""end"": {
		|			""dateTime"": ""%ДатаКонца""
		|			}
		|	}";
		                           
		ДатаНачала = ЗаписатьДатуJSON(ТекСобытие.Дата + ВремяВЧисло(ТекСобытие.ВремяНачала),ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);
		ДатаКонца = ЗаписатьДатуJSON(ТекСобытие.Дата + ВремяВЧисло(ТекСобытие.ВремяКонца),ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);
		
		ТелоЗапроса = СтрЗаменить(ТелоЗапроса,"%Заголовок",ТекСобытие.Содержание);
		ТелоЗапроса = СтрЗаменить(ТелоЗапроса,"%ДатаНачала",ДатаНачала);
		ТелоЗапроса = СтрЗаменить(ТелоЗапроса,"%ДатаКонца",ДатаКонца);
		
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);
			
		Если идСобытия = "" Тогда // новое событие, еще не выгружали в гугл			
			ОтветHTTP = Соединение.ОтправитьДляОбработки(ЗапросHTTP);					
		Иначе
			ЗапросHTTP.АдресРесурса = ЗапросHTTP.АдресРесурса + "/" + идСобытия;
			ОтветHTTP = Соединение.Изменить(ЗапросHTTP);					
		КонецЕсли;
		
		ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		Если ОтветHTTP.КодСостояния = 200 Тогда		
			JSonИт = Новый ЧтениеJSON;
			JSonИт.УстановитьСтроку(ТекстОтвета);
			резИт = ПрочитатьJSON(JSonИт);							
			
			мен = РегистрыСведений.КСУ_ВыгрузкаЗадачВГуглКалендарь.СоздатьМенеджерЗаписи();
			мен.Задача = ТекСобытие.Задача;
			мен.Прочитать();
			мен.Задача = ТекСобытие.Задача;
			мен.ид = резИт.id;
			мен.ТребуетсяВыгрузка = ложь;
			мен.Записать();
		Иначе
			ЗаписьЖурналаРегистрации("КСУ ошибка гугл",,,,"Ошибка выгрузки списка событий "+ ТекстОтвета);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТаблицуПлановВЗапросе(Запрос, дНачала, дКонца, Пользователь = Неопределено) Экспорт
	Мен = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = мен;
	Если Пользователь = Неопределено ТОгда
		Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	Иначе
		Запрос.УстановитьПараметр("ТекПользователь", Пользователь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала", дНачала);
	Запрос.УстановитьПараметр("ДатаКонца", дКонца);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ПланыДействий.Ссылка КАК План,
	               |	ИА_ПланыДействий.ДатаНачала,
	               |	ИА_ПланыДействий.ДатаКонца
	               |ПОМЕСТИТЬ НедельныеПланы
	               |ИЗ
	               |	Справочник.ИА_ПланыДействий КАК ИА_ПланыДействий
	               |ГДЕ
	               |	ИА_ПланыДействий.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_ПланыДействий.Ответственный = &ТекПользователь
	               |	И ИА_ПланыДействий.Родитель = ЗНАЧЕНИЕ(справочник.ИА_ПланыДействий.ПустаяСсылка)
	               |	И ИА_ПланыДействий.ДатаНачала <= &ДатаКонца
	               |	И ИА_ПланыДействий.ДатаКонца >= &ДатаНачала";
	Запрос.Выполнить();

КонецПроцедуры

Процедура ОбновитьДневныеПланы(ПланировщикДень, ДатаНачалаДневныхПланов,ДатаКонцаДневныхПланов, Пользователь = Неопределено) Экспорт
	Запрос = Новый Запрос;
	ЗаполнитьТаблицуПлановВЗапросе(Запрос,ДатаНачалаДневныхПланов,ДатаКонцаДневныхПланов, Пользователь);
		               
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ПланыДействий.Ссылка КАК План,
	               |	ИА_ПланыДействий.ДатаНачала
	               |ПОМЕСТИТЬ ДневныеПланы
	               |ИЗ
	               |	Справочник.ИА_ПланыДействий КАК ИА_ПланыДействий
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НедельныеПланы КАК НедельныеПланы
	               |		ПО ИА_ПланыДействий.Родитель = НедельныеПланы.План
	               |ГДЕ
	               |	ИА_ПланыДействий.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ЗадачиПлана.Ссылка,
	               |	ИА_ЗадачиПлана.Группировка,
	               |	ИА_ЗадачиПлана.Содержание,
	               |	ИА_ЗадачиПлана.Продукт,
	               |	ИА_ЗадачиПлана.Выполнено,
	               |	ДневныеПланы.ДатаНачала КАК ДатаНачала,
	               |	ИА_ЗадачиПлана.ВремяНачала КАК ВремяНачала,
	               |	ИА_ЗадачиПлана.ВремяКонца,
	               |	ЛОЖЬ КАК Гугл,
				   |	ИА_ЗадачиПлана.СрокИсполнения
	               |ИЗ
	               |	Справочник.ИА_ЗадачиПлана КАК ИА_ЗадачиПлана
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДневныеПланы КАК ДневныеПланы
	               |		ПО (ДневныеПланы.План = ИА_ЗадачиПлана.Владелец)
	               |ГДЕ
	               |	ИА_ЗадачиПлана.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	гугл.идСобытия,
	               |	ЗНАЧЕНИЕ(Перечисление.ИА_ТипыЗадачБП.Задачи),
	               |	гугл.Описание,
	               |	"""",
	               |	ЛОЖЬ,
	               |	НАЧАЛОПЕРИОДА(гугл.ДатаНачала, ДЕНЬ),
	               |	гугл.ДатаНачала,
	               |	гугл.ДатаКонца,
	               |	ИСТИНА,
				   |	&ПустаяДата
	               |ИЗ
	               |	РегистрСведений.КСУ_СобытияКалендаряGoogle КАК гугл
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДневныеПланы КАК ДневныеПланы
	               |		ПО (НАЧАЛОПЕРИОДА(гугл.ДатаНачала, ДЕНЬ) = ДневныеПланы.ДатаНачала)
	               |ГДЕ
				   |	гугл.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаКонца
	               |	И ДневныеПланы.План ЕСТЬ NULL
				   |	И гугл.Пользователь = &ТекПользователь
	               |	И гугл.БезВремени = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПустаяДата", дата(1,1,1));
	ПланировщикДень.Элементы.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.гугл тогда
			ДатаНачала    = Выборка.ВремяНачала;
			ДатаОкончания = Выборка.ВремяКонца;
		Иначе
			ДатаНачала    = Выборка.ДатаНачала + ИА_Планы.ВремяВЧисло(Выборка.ВремяНачала);
			ДатаОкончания = Выборка.ДатаНачала + ИА_Планы.ВремяВЧисло(Выборка.ВремяКонца);
		КонецЕсли;
		НовыйЭлемент = ПланировщикДень.Элементы.Добавить(ДатаНачала, ДатаОкончания);
		НовыйЭлемент.Текст = Выборка.Содержание; 
		Если ЗначениеЗаполнено(Выборка.Продукт) Тогда
			НовыйЭлемент.Текст = НовыйЭлемент.Текст + ". Продукт: "+ Выборка.Продукт;
		КонецЕсли;
		
		НовыйЭлемент.Значение = выборка.ссылка;
		
		ПрименитьОформлениеСтроки(Выборка, НовыйЭлемент);		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПрименитьОформлениеСтроки(Данные, элемент) Экспорт
	ЦветЗадача = Новый Цвет(237,245,248);
	ЦветСтратегЗадача = Новый Цвет(237,245,248);
	ЦветРегЗадача = Новый Цвет(237,245,248);	
	ЦветВыпЗадача = Новый Цвет(210,255,210);
	ЦветПросрЗадача = Новый Цвет(255,235,235);
	
	
	Если Данные.Группировка = Перечисления.ИА_ТипыЗадачБП.Регулярные Тогда
		элемент.ЦветФона = ЦветРегЗадача;
		элемент.Картинка = БиблиотекаКартинок.КСУ_РегулярнаяЗадача;
	ИначеЕсли Данные.гугл Тогда
		элемент.ЦветФона = ЦветЗадача;
		элемент.Картинка = БиблиотекаКартинок.КСУ_ЗадачаГугл;
	ИначеЕсли Данные.Группировка = Перечисления.ИА_ТипыЗадачБП.Стратегические Тогда
		элемент.ЦветФона = ЦветСтратегЗадача;
		элемент.Картинка = БиблиотекаКартинок.КСУ_СтратегическаяЗадача;
	ИначеЕсли Данные.Группировка = Перечисления.ИА_ТипыЗадачБП.Задачи или Данные.Группировка = Неопределено Тогда
		Если ЗначениеЗаполнено(Данные.СрокИсполнения) и Данные.СрокИсполнения < НачалоДня(ТекущаяДата()) Тогда
			элемент.ЦветФона = ЦветПросрЗадача;
		Иначе
			элемент.ЦветФона = ЦветЗадача;
		КонецЕсли;
		элемент.Картинка = БиблиотекаКартинок.КСУ_Задача;
	КонецЕсли;
	
	Если Данные.Выполнено Тогда
		элемент.ЦветФона = ЦветВыпЗадача;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьРабочееВремя(ПланировщикДень, Пользователь = Неопределено) Экспорт
	РабВр = ИА_Планы.ПолучитьРабочееВремя(Пользователь);
	ВремяНачалаДня = РабВр.ВремяНачалаДня;
	ВремяКонцаДня = РабВр.ВремяКонцаДня; 
	
	ПланировщикДень.ОтступСНачалаПереносаШкалыВремени = Час(ВремяНачалаДня);
	ПланировщикДень.ОтступСКонцаПереносаШкалыВремени = 24-Час(ВремяКонцаДня);
КонецПроцедуры
